/*
 * (C) Copyright 2016 Siarhei Siamashka <siarhei.siamashka@gmail.com>
 *
 * This program is free software: you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation, either version 2 of the License, or
 * (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program.  If not, see <http://www.gnu.org/licenses/>.
 */

#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <time.h>

#include "fel_lib.h"
#include "progress.h"

#include "fel-remotefunc-spi-data-transfer-v851s.h"

/*****************************************************************************/

struct sunxi_ccm_reg {
    uint32_t pll1_cfg;           /* 0x000 pll1 (cpux) control */
    uint8_t reserved_0x004[12];
    uint32_t pll5_cfg;           /* 0x010 pll5 (ddr) control */
    uint8_t reserved_0x014[12];
    uint32_t pll6_cfg;           /* 0x020 pll6 (periph0) control */
    uint8_t reserved_0x020[4];
    uint32_t pll_periph1_cfg;    /* 0x028 pll periph1 control */
    uint8_t reserved_0x028[4];
    uint32_t pll7_cfg;           /* 0x030 pll7 (gpu) control */
    uint8_t reserved_0x034[12];
    uint32_t pll3_cfg;           /* 0x040 pll3 (video0) control */
    uint8_t reserved_0x044[4];
    uint32_t pll_csi_cfg;        /* 0x048 pll csi control */
    uint8_t reserved_0x04c[12];
    uint32_t pll4_cfg;           /* 0x058 pll4 (ve) control */
    uint8_t reserved_0x05c[4];
    uint32_t pll10_cfg;          /* 0x060 pll10 (de) control */
    uint8_t reserved_0x064[12];
    uint32_t pll9_cfg;           /* 0x070 pll9 (hsic) control */
    uint8_t reserved_0x074[4];
    uint32_t pll2_cfg;           /* 0x078 pll2 (audio) control */
    uint8_t reserved_0x07c[148];
    uint32_t pll5_pat;           /* 0x110 pll5 (ddr) pattern */
    uint8_t reserved_0x114[20];
    uint32_t pll_periph1_pat0;   /* 0x128 pll periph1 pattern0 */
    uint32_t pll_periph1_pat1;   /* 0x12c pll periph1 pattern1 */
    uint32_t pll7_pat0;          /* 0x130 pll7 (gpu) pattern0 */
    uint32_t pll7_pat1;          /* 0x134 pll7 (gpu) pattern1 */
    uint8_t reserved_0x138[8];
    uint32_t pll3_pat0;          /* 0x140 pll3 (video0) pattern0 */
    uint32_t pll3_pat1;          /* 0x144 pll3 (video0) pattern1 */
    uint32_t pll_csi_pat0;       /* 0x148 pll csi pattern0 */
    uint32_t pll_csi_pat1;       /* 0x14c pll csi pattern1 */
    uint8_t reserved_0x150[8];
    uint32_t pll4_pat0;          /* 0x158 pll4 (ve) pattern0 */
    uint32_t pll4_pat1;          /* 0x15c pll4 (ve) pattern1 */
    uint32_t pll10_pat0;         /* 0x160 pll10 (de) pattern0 */
    uint32_t pll10_pat1;         /* 0x164 pll10 (de) pattern1 */
    uint8_t reserved_0x168[8];
    uint32_t pll9_pat0;          /* 0x170 pll9 (hsic) pattern0 */
    uint32_t pll9_pat1;          /* 0x174 pll9 (hsic) pattern1 */
    uint32_t pll2_pat0;          /* 0x178 pll2 (audio) pattern0 */
    uint32_t pll2_pat1;          /* 0x17c pll2 (audio) pattern1 */
    uint8_t reserved_0x180[384];
    uint32_t pll1_bias;          /* 0x300 pll1 (cpux) bias */
    uint8_t reserved_0x304[12];
    uint32_t pll5_bias;          /* 0x310 pll5 (ddr) bias */
    uint8_t reserved_0x314[12];
    uint32_t pll6_bias;          /* 0x320 pll6 (periph0) bias */
    uint8_t reserved_0x324[4];
    uint32_t pll_periph1_bias;   /* 0x328 pll periph1 bias */
    uint8_t reserved_0x32c[4];
    uint32_t pll7_bias;          /* 0x330 pll7 (gpu) bias */
    uint8_t reserved_0x334[12];
    uint32_t pll3_bias;          /* 0x340 pll3 (video0) bias */
    uint8_t reserved_0x344[4];
    uint32_t pll_csi_bias;       /* 0x348 pll video1 bias */
    uint8_t reserved_0x34c[12];
    uint32_t pll4_bias;          /* 0x358 pll4 (ve) bias */
    uint8_t reserved_0x35c[4];
    uint32_t pll10_bias;         /* 0x360 pll10 (de) bias */
    uint8_t reserved_0x364[12];
    uint32_t pll9_bias;          /* 0x370 pll9 (hsic) bias */
    uint8_t reserved_0x374[4];
    uint32_t pll2_bias;          /* 0x378 pll2 (audio) bias */
    uint8_t reserved_0x37c[132];
    uint32_t pll1_tun;           /* 0x400 pll1 (cpux) tunning */
    uint8_t reserved_0x404[252];
    uint32_t cpu_axi_cfg;        /* 0x500 CPUX/AXI clock control*/
    uint8_t reserved_0x504[12];
    uint32_t psi_ahb1_ahb2_cfg;  /* 0x510 PSI/AHB1/AHB2 clock control */
    uint8_t reserved_0x514[8];
    uint32_t ahb3_cfg;           /* 0x51c AHB3 clock control */
    uint32_t apb0_cfg;           /* 0x520 APB0 clock control */
    uint32_t apb1_cfg;           /* 0x524 APB1 clock control */
    uint8_t reserved_0x528[24];
    uint32_t mbus_cfg;           /* 0x540 MBUS clock control */
    uint8_t reserved_0x544[188];
    uint32_t de_clk_cfg;        /* 0x600 DE clock control */
    uint8_t reserved_0x604[8];
    uint32_t de_gate_reset;    /* 0x60c DE gate/reset control */
    uint8_t reserved_0x610[16];
    uint32_t di_clk_cfg;        /* 0x620 DI clock control */
    uint8_t reserved_0x024[8];
    uint32_t di_gate_reset;    /* 0x62c DI gate/reset control */
    uint8_t reserved_0x630[64];
    uint32_t gpu_clk_cfg;    /* 0x670 GPU clock control */
    uint8_t reserved_0x674[8];
    uint32_t gpu_gate_reset;    /* 0x67c GPU gate/reset control */
    uint32_t ce_clk_cfg;        /* 0x680 CE clock control */
    uint8_t reserved_0x684[8];
    uint32_t ce_gate_reset;    /* 0x68c CE gate/reset control */
    uint32_t ve_clk_cfg;        /* 0x690 VE clock control */
    uint8_t reserved_0x694[8];
    uint32_t ve_gate_reset;    /* 0x69c VE gate/reset control */
    uint8_t reserved_0x6a0[16];
    uint32_t emce_clk_cfg;    /* 0x6b0 EMCE clock control */
    uint8_t reserved_0x6b4[8];
    uint32_t emce_gate_reset;    /* 0x6bc EMCE gate/reset control */
    uint32_t vp9_clk_cfg;    /* 0x6c0 VP9 clock control */
    uint8_t reserved_0x6c4[8];
    uint32_t vp9_gate_reset;    /* 0x6cc VP9 gate/reset control */
    uint8_t reserved_0x6d0[60];
    uint32_t dma_gate_reset;    /* 0x70c DMA gate/reset control */
    uint8_t reserved_0x710[12];
    uint32_t msgbox_gate_reset;    /* 0x71c Message Box gate/reset control */
    uint8_t reserved_0x720[12];
    uint32_t spinlock_gate_reset;/* 0x72c Spinlock gate/reset control */
    uint8_t reserved_0x730[12];
    uint32_t hstimer_gate_reset;    /* 0x73c HS Timer gate/reset control */
    uint32_t avs_gate_reset;    /* 0x740 AVS gate/reset control */
    uint8_t reserved_0x744[72];
    uint32_t dbgsys_gate_reset;    /* 0x78c Debugging system gate/reset control */
    uint8_t reserved_0x790[12];
    uint32_t psi_gate_reset;    /* 0x79c PSI gate/reset control */
    uint8_t reserved_0x7a0[12];
    uint32_t pwm_gate_reset;    /* 0x7ac PWM gate/reset control */
    uint8_t reserved_0x7b0[12];
    uint32_t iommu_gate_reset;    /* 0x7bc IOMMU gate/reset control */
    uint8_t reserved_0x7c0[64];
    uint32_t dram_clk_cfg;        /* 0x800 DRAM clock control */
    uint32_t mbus_gate;        /* 0x804 MBUS gate control */
    uint8_t reserved_0x808[4];
    uint32_t dram_gate_reset;    /* 0x80c DRAM gate/reset control */
    uint32_t nand0_clk_cfg;    /* 0x810 NAND0 clock control */
    uint32_t nand1_clk_cfg;    /* 0x814 NAND1 clock control */
    uint8_t reserved_0x818[20];
    uint32_t nand_gate_reset;    /* 0x82c NAND gate/reset control */
    uint32_t sd0_clk_cfg;    /* 0x830 MMC0 clock control */
    uint32_t sd1_clk_cfg;    /* 0x834 MMC1 clock control */
    uint32_t sd2_clk_cfg;    /* 0x838 MMC2 clock control */
    uint8_t reserved_0x83c[16];
    uint32_t sd_gate_reset;    /* 0x84c MMC gate/reset control */
    uint8_t reserved_0x850[188];
    uint32_t uart_gate_reset;    /* 0x90c UART gate/reset control */
    uint8_t reserved_0x910[12];
    uint32_t twi_gate_reset;    /* 0x91c I2C gate/reset control */
    uint8_t reserved_0x920[28];
    uint32_t scr_gate_reset;    /* 0x93c SCR gate/reset control */
    uint32_t spi0_clk_cfg;    /* 0x940 SPI0 clock control */
    uint32_t spi1_clk_cfg;    /* 0x944 SPI1 clock control */
    uint8_t reserved_0x948[8];
    uint32_t spif_clk_cfg;       /* 0x950 SPIF clock control */
    uint8_t reserved_0x954[24];
    uint32_t spi_gate_reset;    /* 0x96c SPI gate/reset control */
    uint8_t reserved_0x970[12];
    uint32_t emac_gate_reset;    /* 0x97c EMAC gate/reset control */
    uint8_t reserved_0x980[48];
    uint32_t ts_clk_cfg;        /* 0x9b0 TS clock control */
    uint8_t reserved_0x9b4[8];
    uint32_t ts_gate_reset;    /* 0x9bc TS gate/reset control */
    uint32_t irtx_clk_cfg;    /* 0x9c0 IR TX clock control */
    uint8_t reserved_0x9c4[8];
    uint32_t irtx_gate_reset;    /* 0x9cc IR TX gate/reset control */
    uint8_t reserved_0x9d0[32];
    uint32_t gpadc_gate_reset;    /*0x9ec gpadc gate/reset control*/
    uint8_t reserved_0x9f0[8];
    uint32_t ths_gate_reset;    /* 0x9fc THS gate/reset control */
    uint8_t reserved_0xa00[12];
    uint32_t i2s3_clk_cfg;    /* 0xa0c I2S3 clock control */
    uint32_t i2s0_clk_cfg;    /* 0xa10 I2S0 clock control */
    uint32_t i2s1_clk_cfg;    /* 0xa14 I2S1 clock control */
    uint32_t i2s2_clk_cfg;    /* 0xa18 I2S2 clock control */
    uint32_t i2s_gate_reset;    /* 0xa1c I2S gate/reset control */
    uint32_t spdif_clk_cfg;    /* 0xa20 SPDIF clock control */
    uint8_t reserved_0xa24[8];
    uint32_t spdif_gate_reset;    /* 0xa2c SPDIF gate/reset control */
    uint8_t reserved_0xa30[16];
    uint32_t dmic_clk_cfg;    /* 0xa40 DMIC clock control */
    uint8_t reserved_0xa44[8];
    uint32_t dmic_gate_reset;    /* 0xa4c DMIC gate/reset control */
    uint8_t reserved_0xa50[16];
    uint32_t ahub_clk_cfg;    /* 0xa60 Audio HUB clock control */
    uint8_t reserved_0xa64[8];
    uint32_t ahub_gate_reset;    /* 0xa6c Audio HUB gate/reset control */
    uint32_t usb0_clk_cfg;    /* 0xa70 USB0(OTG) clock control */
    uint32_t usb1_clk_cfg;    /* 0xa74 USB1(XHCI) clock control */
    uint8_t reserved_0xa78[4];
    uint32_t usb3_clk_cfg;    /* 0xa78 USB3 clock control */
    uint8_t reserved_0xa80[12];
    uint32_t usb_gate_reset;    /* 0xa8c USB gate/reset control */
    uint8_t reserved_0xa90[32];
    uint32_t pcie_ref_clk_cfg;    /* 0xab0 PCIE REF clock control */
    uint32_t pcie_axi_clk_cfg;    /* 0xab4 PCIE AXI clock control */
    uint32_t pcie_aux_clk_cfg;    /* 0xab8 PCIE AUX clock control */
    uint32_t dpss_top_bgr;    /* 0xabc DPSS TOP BUS Gating Reset */
    uint8_t reserved_0xac0[64];
    uint32_t hdmi_clk_cfg;    /* 0xb00 HDMI clock control */
    uint32_t hdmi_slow_clk_cfg;    /* 0xb04 HDMI slow clock control */
    uint8_t reserved_0xb08[8];
    uint32_t hdmi_cec_clk_cfg;    /* 0xb10 HDMI CEC clock control */
    uint8_t reserved_0xb14[8];
    uint32_t hdmi_gate_reset;    /* 0xb1c HDMI gate/reset control */
    uint8_t reserved_0xb20[60];
    uint32_t tcon_top_gate_reset;/* 0xb5c TCON TOP gate/reset control */
    uint32_t tcon_lcd0_clk_cfg;    /* 0xb60 TCON LCD0 clock control */
    uint8_t reserved_0xb64[24];
    uint32_t tcon_lcd_gate_reset;/* 0xb7c TCON LCD gate/reset control */
    uint32_t tcon_tv0_clk_cfg;    /* 0xb80 TCON TV0 clock control */
    uint8_t reserved_0xb84[24];
    uint32_t tcon_tv_gate_reset;    /* 0xb9c TCON TV gate/reset control */
    uint8_t reserved_0xba0[96];
    uint32_t csi_misc_clk_cfg;    /* 0xc00 CSI MISC clock control */
    uint32_t csi_top_clk_cfg;    /* 0xc04 CSI TOP clock control */
    uint32_t csi_mclk_cfg;    /* 0xc08 CSI Master clock control */
    uint8_t reserved_0xc0c[32];
    uint32_t csi_gate_reset;    /* 0xc2c CSI gate/reset control */
    uint8_t reserved_0xc30[16];
    uint32_t hdcp_clk_cfg;    /* 0xc40 HDCP clock control */
    uint8_t reserved_0xc44[8];
    uint32_t hdcp_gate_reset;    /* 0xc4c HDCP gate/reset control */
    uint8_t reserved_0xc50[688];
    uint32_t ccu_sec_switch;    /* 0xf00 CCU security switch */
    uint32_t gpadc_clk_sel;    /* 0xf04 PLL lock debugging control */
};

struct core_pll_freq_tbl {
    int FactorN;
    int FactorK;
    int FactorM;
    int FactorP;
    int pading;
};

/* Debugging */
#define DBG_INFO(...)
//#define DBG_INFO(...) printf(__VA_ARGS__)

/* V851S defines */
#define CONFIG_MACH_SUN8IW21
#define SUNXI_CCM_BASE         (0x02001000)
#define SUNXI_RTC_BASE         (0x07090000)
#define SPI_XFER_END           (1<<1)
#define SPI_XFER_BEGIN         (1<<0)

/* pll1 bit field */
#define CCM_PLL1_CTRL_EN		BIT(31)
#define CCM_PLL1_LOCK_EN		BIT(29)
#define CCM_PLL1_LOCK			BIT(28)
#define CCM_PLL1_CLOCK_TIME_2		(2 << 24)
#define CCM_PLL1_CTRL_N(n)		((n) << 8)

/* pll5 bit field */
#define CCM_PLL5_CTRL_EN		BIT(31)
#define CCM_PLL5_LOCK_EN		BIT(29)
#define CCM_PLL5_LOCK			BIT(28)
#define CCM_PLL5_CTRL_N(n)		((n) << 8)
#define CCM_PLL5_CTRL_DIV1(div1)	((div1) << 0)
#define CCM_PLL5_CTRL_DIV2(div0)	((div0) << 1)

/* pll6 bit field */
#define CCM_PLL6_CTRL_EN		BIT(31)
